Revit 2026 API

# TableSectionDataFirstRowNumber Property

---

The first row in this section of the table.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int FirstRowNumber { get; }
```
```vb
Public ReadOnly Property FirstRowNumber As Integer
	Get
```
```cpp
public:
property int FirstRowNumber {
	int get ();
}
```
```fsharp
member FirstRowNumber : int with get
```

#### Property Value

Int32

Some table sections have row 0 as their first row while others start with row 1.

#### Reference

TableSectionData Class

Autodesk.Revit.DB Namespace